todo.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>TODO</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="TODO"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-11-24T18:59+0200"/>
<meta name="author" content="Andrey Kotlarski"/>
<meta name="description" content="Andrey Kotlarski's near future FLOSS todo"/>
<meta name="keywords" content="andrey kotlarski,floss,emacs,computer chess,neurostock,stockfish,vlf"/>
<link rel="stylesheet" type="text/css" href="css/worg-classic.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="sitemap.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">TODO</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Emacs</a>
<ul>
<li><a href="#sec-1-1">1.1 inumber</a></li>
<li><a href="#sec-1-2">1.2 Isearch</a></li>
<li><a href="#sec-1-3">1.3 VLF</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Computer chess</a>
<ul>
<li><a href="#sec-2-1">2.1 Rebase neuroStock to latest Stockfish</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Emacs</h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> inumber</h3>
<div class="outline-text-3" id="text-1-1">


<ul>
<li>port <a href="https://github.com/emacsmirror/w3m/blob/master/w3m-lnum.el">w3m-lnum.el</a> to <a href="http://www.emacswiki.org/emacs/eww">eww</a>

</li>
<li>abstract common machinery and make it reusable

</li>
<li>make a little screencast for w3m-lnum
</li>
</ul>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> <a href="http://www.emacswiki.org/emacs/IncrementalSearch">Isearch</a></h3>
<div class="outline-text-3" id="text-1-2">


<p>
Enumerate multiple matches and allow direct jumps.
</p>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> <a href="https://github.com/m00natic/vlfi">VLF</a></h3>
<div class="outline-text-3" id="text-1-3">


<ul>
<li>research encoding/decoding problems in trunk Emacs, possibly
  optimize detection of right decoding

</li>
<li>re-use <a href="http://www.emacswiki.org/emacs/GrepMode">grep</a> or <a href="http://www.emacswiki.org/emacs/OccurMode">occur</a> for indexing if possible

</li>
<li>re-use isearch if possible

</li>
<li>add <a href="http://www.emacswiki.org/emacs/EdiffMode">ediff</a> support

</li>
<li>figure out edit + batch movement integration
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Computer chess</h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Rebase <a href="https://github.com/m00natic/neuroStock">neuroStock</a> to latest <a href="https://github.com/mcostalba/Stockfish">Stockfish</a></h3>
<div class="outline-text-3" id="text-2-1">

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-11-24T18:59+0200</p>
<p class="author">Author: Andrey Kotlarski</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
